import string

functions = {'a': 'Створити новий запис (додати заплановану справу)',
             'b': 'Знайти запис за частиною назви та переглянути її деталі',
             'c': 'Знайти та помітити справу, як виконану',
             'd': 'Знайти справу та змінити її пріоритет',
             'e': 'Знайти та видалити справу',
             'f': 'Переглянути всі заплановані справи (тільки назви) у порядку їхнього додавання',
             'g': 'Переглянути всі заплановані справи (тільки назви) у порядку спадання пріоритету',
             'h': 'Переглянути всі невиконані справи (тільки назви)',
             'i': 'Переглянути виконані справи (тільки назви)',
             'j': 'Переглянути прострочені справи (тільки назви)',
             'k': 'Переглянути статистику (загальна кількість справ, '
                  'кількість виконаних/невиконаних/прострочених справ)',
             'l': 'Зберегти список задач у форматі csv',
             'm': 'Вийти'
             }

my_list = list(string.ascii_lowercase)
cut = my_list.index('n')
answer_option = my_list[:cut]